After conv1: torch.Size([2, 32, 149, 149])
After conv2: torch.Size([2, 32, 147, 147])
After conv3: torch.Size([2, 64, 147, 147])
After pool1: torch.Size([2, 64, 74, 74])
After conv4: torch.Size([2, 80, 72, 72])
After conv5: torch.Size([2, 192, 35, 35])
After conv6: torch.Size([2, 256, 35, 35])
After channel_adjust: torch.Size([2, 288, 35, 35])
After inception_A1: torch.Size([2, 288, 35, 35])
After inception_A2: torch.Size([2, 288, 35, 35])
After inception_A3: torch.Size([2, 288, 35, 35])
After reduction_1: torch.Size([2, 768, 18, 18])
After inception_B1: torch.Size([2, 768, 18, 18])
After reduction_2: torch.Size([2, 1280, 8, 8])
After inception_C1: torch.Size([2, 2048, 8, 8])
After pool2: torch.Size([2, 2048, 1, 1])
After flatten: torch.Size([2, 2048])
After fc: torch.Size([2, 1000])
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 149, 149]             896
            Conv2d-2         [-1, 32, 147, 147]           9,248
            Conv2d-3         [-1, 64, 147, 147]          18,496
         MaxPool2d-4           [-1, 64, 74, 74]               0
            Conv2d-5           [-1, 80, 72, 72]          46,160
            Conv2d-6          [-1, 192, 35, 35]         138,432
            Conv2d-7          [-1, 256, 35, 35]         442,624
            Conv2d-8          [-1, 288, 35, 35]          74,016
            Conv2d-9           [-1, 64, 35, 35]          18,496
           Conv2d-10           [-1, 96, 35, 35]          27,744
           Conv2d-11          [-1, 128, 35, 35]         110,720
           Conv2d-12           [-1, 16, 35, 35]           4,624
           Conv2d-13           [-1, 48, 35, 35]           6,960
           Conv2d-14           [-1, 48, 35, 35]          20,784
        MaxPool2d-15          [-1, 288, 35, 35]               0
           Conv2d-16           [-1, 48, 35, 35]          13,872
    InceptionV2_A-17          [-1, 288, 35, 35]               0
           Conv2d-18           [-1, 64, 35, 35]          18,496
           Conv2d-19           [-1, 96, 35, 35]          27,744
           Conv2d-20          [-1, 128, 35, 35]         110,720
           Conv2d-21           [-1, 16, 35, 35]           4,624
           Conv2d-22           [-1, 48, 35, 35]           6,960
           Conv2d-23           [-1, 48, 35, 35]          20,784
        MaxPool2d-24          [-1, 288, 35, 35]               0
           Conv2d-25           [-1, 48, 35, 35]          13,872
    InceptionV2_A-26          [-1, 288, 35, 35]               0
           Conv2d-27           [-1, 64, 35, 35]          18,496
           Conv2d-28           [-1, 96, 35, 35]          27,744
           Conv2d-29          [-1, 128, 35, 35]         110,720
           Conv2d-30           [-1, 16, 35, 35]           4,624
           Conv2d-31           [-1, 48, 35, 35]           6,960
           Conv2d-32           [-1, 48, 35, 35]          20,784
        MaxPool2d-33          [-1, 288, 35, 35]               0
           Conv2d-34           [-1, 48, 35, 35]          13,872
    InceptionV2_A-35          [-1, 288, 35, 35]               0
           Conv2d-36          [-1, 768, 18, 18]       1,991,424
           Conv2d-37          [-1, 192, 18, 18]         147,648
           Conv2d-38          [-1, 256, 18, 18]         196,864
           Conv2d-39          [-1, 320, 18, 18]         246,080
           Conv2d-40          [-1, 320, 18, 18]         307,520
           Conv2d-41           [-1, 64, 18, 18]          49,216
           Conv2d-42          [-1, 128, 18, 18]          41,088
           Conv2d-43          [-1, 128, 18, 18]          82,048
           Conv2d-44          [-1, 128, 18, 18]          82,048
           Conv2d-45          [-1, 128, 18, 18]          82,048
        MaxPool2d-46          [-1, 768, 18, 18]               0
           Conv2d-47          [-1, 128, 18, 18]          98,432
    InceptionV2_B-48          [-1, 768, 18, 18]               0
           Conv2d-49          [-1, 192, 18, 18]         147,648
           Conv2d-50          [-1, 256, 18, 18]         196,864
           Conv2d-51          [-1, 320, 18, 18]         246,080
           Conv2d-52          [-1, 320, 18, 18]         307,520
           Conv2d-53           [-1, 64, 18, 18]          49,216
           Conv2d-54          [-1, 128, 18, 18]          41,088
           Conv2d-55          [-1, 128, 18, 18]          82,048
           Conv2d-56          [-1, 128, 18, 18]          82,048
           Conv2d-57          [-1, 128, 18, 18]          82,048
        MaxPool2d-58          [-1, 768, 18, 18]               0
           Conv2d-59          [-1, 128, 18, 18]          98,432
    InceptionV2_B-60          [-1, 768, 18, 18]               0
           Conv2d-61          [-1, 192, 18, 18]         147,648
           Conv2d-62          [-1, 256, 18, 18]         196,864
           Conv2d-63          [-1, 320, 18, 18]         246,080
           Conv2d-64          [-1, 320, 18, 18]         307,520
           Conv2d-65           [-1, 64, 18, 18]          49,216
           Conv2d-66          [-1, 128, 18, 18]          41,088
           Conv2d-67          [-1, 128, 18, 18]          82,048
           Conv2d-68          [-1, 128, 18, 18]          82,048
           Conv2d-69          [-1, 128, 18, 18]          82,048
        MaxPool2d-70          [-1, 768, 18, 18]               0
           Conv2d-71          [-1, 128, 18, 18]          98,432
    InceptionV2_B-72          [-1, 768, 18, 18]               0
           Conv2d-73          [-1, 192, 18, 18]         147,648
           Conv2d-74          [-1, 256, 18, 18]         196,864
           Conv2d-75          [-1, 320, 18, 18]         246,080
           Conv2d-76          [-1, 320, 18, 18]         307,520
           Conv2d-77           [-1, 64, 18, 18]          49,216
           Conv2d-78          [-1, 128, 18, 18]          41,088
           Conv2d-79          [-1, 128, 18, 18]          82,048
           Conv2d-80          [-1, 128, 18, 18]          82,048
           Conv2d-81          [-1, 128, 18, 18]          82,048
        MaxPool2d-82          [-1, 768, 18, 18]               0
           Conv2d-83          [-1, 128, 18, 18]          98,432
    InceptionV2_B-84          [-1, 768, 18, 18]               0
           Conv2d-85          [-1, 192, 18, 18]         147,648
           Conv2d-86          [-1, 256, 18, 18]         196,864
           Conv2d-87          [-1, 320, 18, 18]         246,080
           Conv2d-88          [-1, 320, 18, 18]         307,520
           Conv2d-89           [-1, 64, 18, 18]          49,216
           Conv2d-90          [-1, 128, 18, 18]          41,088
           Conv2d-91          [-1, 128, 18, 18]          82,048
           Conv2d-92          [-1, 128, 18, 18]          82,048
           Conv2d-93          [-1, 128, 18, 18]          82,048
        MaxPool2d-94          [-1, 768, 18, 18]               0
           Conv2d-95          [-1, 128, 18, 18]          98,432
    InceptionV2_B-96          [-1, 768, 18, 18]               0
           Conv2d-97           [-1, 1280, 8, 8]       8,848,640
           Conv2d-98            [-1, 512, 8, 8]         655,872
           Conv2d-99            [-1, 512, 8, 8]         655,872
          Conv2d-100            [-1, 384, 8, 8]         590,208
          Conv2d-101            [-1, 384, 8, 8]         442,752
          Conv2d-102            [-1, 512, 8, 8]         655,872
          Conv2d-103            [-1, 512, 8, 8]       2,359,808
          Conv2d-104            [-1, 512, 8, 8]         786,944
          Conv2d-105            [-1, 512, 8, 8]         786,944
       MaxPool2d-106           [-1, 1280, 8, 8]               0
          Conv2d-107            [-1, 640, 8, 8]         819,840
   InceptionV2_C-108           [-1, 2048, 8, 8]               0
          Conv2d-109            [-1, 512, 8, 8]       1,049,088
          Conv2d-110            [-1, 512, 8, 8]       1,049,088
          Conv2d-111            [-1, 384, 8, 8]         590,208
          Conv2d-112            [-1, 384, 8, 8]         442,752
          Conv2d-113            [-1, 512, 8, 8]       1,049,088
          Conv2d-114            [-1, 512, 8, 8]       2,359,808
          Conv2d-115            [-1, 512, 8, 8]         786,944
          Conv2d-116            [-1, 512, 8, 8]         786,944
       MaxPool2d-117           [-1, 2048, 8, 8]               0
          Conv2d-118            [-1, 640, 8, 8]       1,311,360
   InceptionV2_C-119           [-1, 2048, 8, 8]               0
AdaptiveAvgPool2d-120           [-1, 2048, 1, 1]               0
          Linear-121                 [-1, 1000]       2,049,000
================================================================
Total params: 38,072,888
Trainable params: 38,072,888
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.02
Forward/backward pass size (MB): 114.35
Params size (MB): 145.24
Estimated Total Size (MB): 260.61
----------------------------------------------------------------
